<h3>Missing Data</h3>

In [1]:
import pandas as pd
import numpy as np

In [4]:
d = {'A':[1,2,np.nan] ,'B':[5,np.nan,np.nan] ,'C':[1,2,3]}
d

{'A': [1, 2, nan], 'B': [5, nan, nan], 'C': [1, 2, 3]}

In [6]:
df = pd.DataFrame(d)
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

<p>Metodo dropna</p>
<p>Sirve para eliminar filas o columnas (indicando axis = 1) que tengas valores faltantes.</p>

In [8]:
df.dropna() # Escrito asi, el metodo eliminara toda fila con al menos un valor faltante o nulo. Para hacerlo con columnas axis=1
df.dropna(axis=1)

   C
0  1
1  2
2  3

In [10]:
df.dropna(thresh=2) # El parametro thesh sirve para indica hasta cauntos nulos acepto, en este caso menos que dos

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

<p>Metodo fillna</p>
<p>Sirve para completar los valores faltantes. Con el argumento value = x se indica en numero</p>

In [11]:
df.fillna(value = 'FILL VALUE')

            A           B  C
0         1.0         5.0  1
1         2.0  FILL VALUE  2
2  FILL VALUE  FILL VALUE  3

In [13]:
df['A'].fillna(value = df['A'].min()) # Completo con el menor

0    1.0
1    2.0
2    1.0
Name: A, dtype: float64

<h3>Group By</h3>

In [16]:
data = {'Company':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
       'Person':['Sam','Charlie','Amy','Vanessa','Carl','Sarah'],
       'Sales':[200,120,340,124,243,350]}
data

{'Company': ['GOOG', 'GOOG', 'MSFT', 'MSFT', 'FB', 'FB'],
 'Person': ['Sam', 'Charlie', 'Amy', 'Vanessa', 'Carl', 'Sarah'],
 'Sales': [200, 120, 340, 124, 243, 350]}

In [18]:
df = pd.DataFrame(data)
df

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [19]:
bycomp = df.groupby('Company') # Le paso la columna por la cual agrupo

In [20]:
bycomp.mean() # Obtengo la media

         Sales
Company
FB       296.5
GOOG     160.0
MSFT     232.0

In [21]:
bycomp.sum() # Obtengo la suma

         Sales
Company
FB         593
GOOG       320
MSFT       464

In [22]:
bycomp.std() # Obtengo la desviacion estandar

              Sales
Company
FB        75.660426
GOOG      56.568542
MSFT     152.735065

In [23]:
bycomp.sum().loc['FB'] # Me devuelve la suma de la fila 'FB'

Sales    593
Name: FB, dtype: int64

In [25]:
df.groupby('Company').count()
# Tambien estan los metodos max, min

         Person  Sales
Company
FB            2      2
GOOG          2      2
MSFT          2      2

In [26]:
df.groupby('Company').describe() # Devuelve datos de cada fila

        Sales
        count   mean         std    min     25%    50%     75%    max
Company
FB        2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0
GOOG      2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
MSFT      2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0